#-это комментарий
# print("HELLO WORLD")
#**-Возведение в степень
#%-деление по модулю
#//-целочисленное деление с отбрасыванием дробной части
#/-деление *-умножение - -вычитание  + -сложение ОПЕРАТОР
# print(23 % 7)
# print(23 // 7)
# int() целочисленный тип данных, целые числа (ТИП ДАНнЫХ)
# "" - str() cтроки (ТИП ДАННЫХ)
# float - вещественные числа (числа с плавающей точкой) (ТИП ДАННЫХ)
# my_name = "Соня "
# my_friend = "Женя"
# my_probel = " "
# my_number = 13
# print(my_name + " " + my_friend)
# print(my_name + my_probel + my_friend)
# print(my_name + " 13")
# print(my_name + my_probel + str(my_number))
# print(f"{my_name} любимое число {my_number}") # f"{переменная}строка" - функция f-string, которая делает интерполяцию
# print(my_name * 5)
# переменная - это область памяти компьютера, в которой может храниться одиночное значение, знак = является оператором присваивания и сохраняет значение
# color = "green"
# print(color)
# имя переменной должно представлять собой одно слово без пробелов, в имено переменной могут использоваться только буквы, цифры, символы подчеркивания
# имя переменной не может начинаться с цифры
# _ = "my little var"
# print(_)
# переменная не обозначается через -, и спец.символы типа$
# print(len(my_name))
#my_name = int(input("ввод:"))
#my_name1 = float(input("ввод"))
#print("привет " + my_name)
#print(5 + my_name1)
# все что введешь в input на выходе будет строка
# конкатенация - это сложение/склеивание строк
# репликация - это умножение разных типов данных
# домашка - повторить и проработать все дома + проработать с конк+ репл и инпут, проработать с мат.операторам
# посмотреть инфо про функцию len() - относится к категории встроенных функций, ознакомиться со списком встроенных функций в питоне, обратить особое внимание на функцию round()







